/*Основы программирования на C++
Урок 1. Вводный модуль. Первая программа*/

//Итоги пройденных тем. Проверь себя

#include <iostream>

int main()
{
    //Вариант 1. Легко и непринуждённо.
    std::cout << "======================\n";
    std::cout << "Hello,\n";
    std::cout << "World\n";
    std::cout << "======================\n";

    //Вариант 2. Красиво.
    std::cout << "======================\n";
    std::cout << "||      Hello,      ||\n";
    std::cout << "||      World       ||\n";
    std::cout << "======================\n";

    //Вариант 3. Ещё лучше.
    std::cout << "======================\n";
    std::cout << "||                  ||\n";
    std::cout << "||                  ||\n";
    std::cout << "||      Hello,      ||\n";
    std::cout << "||      World       ||\n";
    std::cout << "||                  ||\n";
    std::cout << "||                  ||\n";
    std::cout << "======================\n";

    return 0;
}
